Revit 2021.1 API
FabricationService.IsValidButtonIndex Method
 Validates the button index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2016
Syntax
C#
public bool IsValidButtonIndex(
	int groupIndex,
	int buttonIndex
)
Visual Basic
Public Function IsValidButtonIndex ( _
	groupIndex As Integer, _
	buttonIndex As Integer _
) As Boolean
Visual C++
public:
bool IsValidButtonIndex(
	int groupIndex,
	int buttonIndex
)
Parameters
groupIndex
Type: System.Int32
 The group index.
buttonIndex
Type: System.Int32
 The button index to check.
Return Value
 True if larger or equal to 0 and less than GroupCount.
See Also
FabricationService Class
Autodesk.Revit.DB Namespace